app/controllers/boards_controller.rb

	def index
		@boards = Board.all
---
SELECT "boards".* FROM "boards"

	def show
		@board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@board = Board.new(params_board)
		@board.save
---
INSERT INTO "boards" ("title", "editor", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title"], ["editor", "name"], ["created_at", "2018-07-03 08:06:56.216810"], ["updated_at", "2018-07-03 08:06:56.216810"]]

	def edit
		@board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@board = Board.find(params[:id])
		@board.update_attributes(params_board)
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "boards" SET "title" = ?, "updated_at" = ? WHERE "boards"."id" = ?  [["title", "Stampshot"], ["updated_at", "2018-07-03 08:33:27.023756"], ["id", 1]]

	def destroy
		@board = Board.find(params[:id])
		@board.destroy
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 3]]